s = '0123456789ABCDEF'

print('1',s[2]) #вывод третьего символа строки
print('2', s[-2]) #вывод предпоследнего символа строки
print('3', s[:5]) #вывод первых пять символов строки
print('4', s[:-2]) #вывод всей строки, кроме двух последних символов
print('5', s[::2]) #вывод всей символов с четными индексами
print('6', s[1::2]) #вывод всей символов с четными индексами
print('7', s[::-1]) #вывод всей символов с четными индексами
print('8', s[-1::-2]) #вывод всех символов строки через один в обратном порядке, начиная с последнего
print('9', len(s)) #вывод длины строки
